### Pandas Intro ###

(https://www.geeksforgeeks.org/pandas-tutorial/)

(https://www.geeksforgeeks.org/introduction-to-pandas-in-python/)

<b>Series</b>
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called indexes.
Pandas Series is nothing but a column in an Excel sheet. Labels need not be unique but must be a hashable type. The object supports both integer and label-based indexing and provides a host of methods for performing operations involving the index.

***Creating a Series***

In [1]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series()
print("Series are :",ser)

Series are : Series([], dtype: object)

In [3]:
data1 =  np.array(['s','r','i','n','i'])
ser = pd.Series(data1)
print("Series is: \n",ser)

Series is:
 0    s
1    r
2    i
3    n
4    i
dtype: object

<b>Creating Data Frame</b>
In the real world, a Pandas DataFrame will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, or an Excel file. Pandas DataFrame can be created from lists, dictionaries, and from a list of dictionaries, etc.

<b>DataFrame</b> is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.

In [4]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
lst = ['cat','dog','fish','turtle']
df = pd.DataFrame(lst)
print(df)

        0
0     cat
1     dog
2    fish
3  turtle

***Creating a Pandas DataFrame***

(https://www.geeksforgeeks.org/creating-a-pandas-dataframe/)

<b>Pandas DataFrame</b> is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In the real world, a Pandas DataFrame will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, or an Excel file. Pandas DataFrame can be created from lists, dictionaries, and from a list of dictionaries, etc.

In [6]:
df = pd.DataFrame()

In [7]:
lst = ['greek','roman','indus valley',"egyptian"]
df = pd.DataFrame(lst)
print(df)

              0
0         greek
1         roman
2  indus valley
3      egyptian

In [8]:
dict1 = {'name':['Shun','Riley','Joe','Anna'],'Age':[20,23,44,45]}

In [9]:
df = pd.DataFrame(dict1)
print(df)

    name  Age
0   Shun   20
1  Riley   23
2    Joe   44
3   Anna   45

In [10]:
dict2 = {
         'name':['Shun','Riley','Joe','Anna','Adam'],
         'Age':[20,23,44,25,23],
         'tscore':[1.99,2.55,1.23,3.0,1.78]}
df = pd.DataFrame(dict2)
print(df)

    name  Age  tscore
0   Shun   20    1.99
1  Riley   23    2.55
2    Joe   44    1.23
3   Anna   25    3.00
4   Adam   23    1.78

***Python Pandas Series***

Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.)

In [11]:
data1 = [1,2,3,4,5]
ser = pd.DataFrame(data1)
print(ser)

   0
0  1
1  2
2  3
3  4
4  5

The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet.

***Python Pandas Series***

In [12]:
dt = np.array(['s','r','i','n','i','v','a','s'])
ser = pd.Series(dt)
print(ser)

0    s
1    r
2    i
3    n
4    i
5    v
6    a
7    s
dtype: object

In [13]:
print(ser.dtype)

object

In [14]:
#Creating a series from Lists
lst = ['alpha','beta','gamma','lambda']
ser = pd.Series(lst)
print(ser)

0     alpha
1      beta
2     gamma
3    lambda
dtype: object

<b>Accessing element of Series</b>

Accessing Element from Series with Position : In order to access the series element refers to the index number. Use the index operator [ ] to access an element in a series. The index must be an integer. In order to access multiple elements from a series, we use Slice operation.

In [15]:
s = ['s','r','i','n','i','v','a','s']
ser = pd.Series(s)
print(ser)
print(ser[:5])

0    s
1    r
2    i
3    n
4    i
5    v
6    a
7    s
dtype: object
0    s
1    r
2    i
3    n
4    i
dtype: object

<b>Accessing Element Using Label (index) :</b>
In order to access an element from series, we have to set values by index label. A Series is like a fixed-size dictionary in that you can get and set values by index label.

In [16]:
lst = 'blackhole'
lst1 =[i for i in lst]
print(lst1)
print(len(lst))

['b', 'l', 'a', 'c', 'k', 'h', 'o', 'l', 'e']
9

In [17]:
arr = np.array(lst1)
rand = np.random.randint(100,size=(9))
#print(rand)
ser = pd.Series(arr,index=rand)
print(ser)

17    b
23    l
55    a
24    c
63    k
98    h
13    o
93    l
0     e
dtype: object

In [19]:
print(ser[93])

l

<b>Indexing and Selecting Data in Series</b>

(https://www.geeksforgeeks.org/python-pandas-series/)

Indexing in pandas means simply selecting particular data from a Series. Indexing could mean selecting all the data, some of the data from particular columns. Indexing can also be known as Subset

In [20]:
read_csv = pd.read_csv(r"C:\Users\srini\OneDrive\kaggle\lunar_mission_project\Moonlanding.csv", encoding="ISO-8859-1")

In [21]:
read_csv.columns

Index(['Mission', 'Spacecraft', 'Launch Date', 'Carrier Rocket', 'Operator',
       'Mission Type', 'Outcome', 'Additional Information'],
      dtype='object')

In [22]:
ser = pd.Series(read_csv['Spacecraft'])
data1 = ser.head(10)
data1

0        Pioneer 0
1    Luna E-1 No.1
2        Pioneer 1
3    Luna E-1 No.2
4        Pioneer 2
5    Luna E-1 No.3
6        Pioneer 3
7           Luna 1
8        Pioneer 4
9        E-1A No.1
Name: Spacecraft, dtype: object

In [23]:
# using indexing operator
data1[3:6]

3    Luna E-1 No.2
4        Pioneer 2
5    Luna E-1 No.3
Name: Spacecraft, dtype: object

Indexing a Series using .loc[ ] :
    
This function selects data by refering the explicit index . The df.loc indexer selects data in a different way than just the indexing operator. It can select subsets of data.

In [24]:
data1.loc[3:6]

3    Luna E-1 No.2
4        Pioneer 2
5    Luna E-1 No.3
6        Pioneer 3
Name: Spacecraft, dtype: object

Indexing a Series using .iloc[ ] :

This function allows us to retrieve data by position. In order to do that, weâ€™ll need to specify the positions of the data that we want. The df.iloc indexer is very similar to df.loc but only uses integer locations to make its selections.

In [25]:
data1.iloc[3:6]

3    Luna E-1 No.2
4        Pioneer 2
5    Luna E-1 No.3
Name: Spacecraft, dtype: object

***Binary Operation on Series***

We can perform binary operation on series like addition, subtraction and many other operation. In order to perform binary operation on series we have to use some function like .add(),.sub() etc..

In [26]:
d1 = pd.Series([1,3,5,7,9],index=['a','b','c','d','e'])
d2 = pd.Series([2,4,6,8,10],index=['a','b','c','d','e'])
print(d1,"\n",d2)

a    1
b    3
c    5
d    7
e    9
dtype: int64
 a     2
b     4
c     6
d     8
e    10
dtype: int64

In [27]:
#Now we add two series using .add() function.
d1.add(d2,fill_value=0)

a     3
b     7
c    11
d    15
e    19
dtype: int64

fill_value : [None or float value, default None] Fill missing (NaN) values with this value. If both DataFrame locations are missing, the result will be missing.

In [28]:
d1.sub(d2,fill_value=0)

a   -1
b   -1
c   -1
d   -1
e   -1
dtype: int64

***Conversion Operation on Series***

In conversion operation we perform various operation like changing datatype of series, changing a series to list etc. In order to perform conversion operation we have various function which help in conversion like .astype(), .tolist() etc.

In [29]:
dict12 = {
    "Name":['Alice',"Jesse","Kalin","Kylie","Hugo"],
    "Team":["Cobra","Lion","Panda,","Eagle","Eagle"],
    "Salary":['100000','150000','120000','400000','500000']
}

In [30]:
pd1 = pd.DataFrame(dict12)
pd1_before_type = pd1.dtypes

In [31]:
pd1_before_type

Name      object
Team      object
Salary    object
dtype: object

In [32]:
pd1['Name'] = pd1['Name'].astype(str)
pd1['Team'] = pd1['Team'].astype(str)
pd1['Salary'] = pd1['Salary'].astype(int)

In [33]:
pd1_after_type = pd1.dtypes

In [34]:
pd1_after_type

Name      object
Team      object
Salary     int32
dtype: object

In [35]:
pd1

    Name    Team  Salary
0  Alice   Cobra  100000
1  Jesse    Lion  150000
2  Kalin  Panda,  120000
3  Kylie   Eagle  400000
4   Hugo   Eagle  500000

In [36]:
pd1['Salary'].sum()

1270000

In [37]:
pd1['Salary'].prod()

1744830464

(https://www.geeksforgeeks.org/python-pandas-dataframe-series-head-method/?ref=lbp)

***Python and Pandas Dataframe/Series.head() method***

Pandas head() method is used to return top n (5 by default) rows of a data frame or series.

In [38]:
data_nba = pd.read_csv(r"C:\Users\srini\OneDrive\kaggle\nba.csv")

In [39]:
data_top = data_nba.head()

In [40]:
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [41]:
n = 9 
series_data = data_nba["Name"]
top = series_data.head(n=n)
top

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
Name: Name, dtype: object

***Python | Pandas Dataframe/Series.tail()***

Pandas tail() method is used to return bottom n (5 by default) rows of a data frame or series.

In [42]:
data_tail = data_nba.tail()
data_tail

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
n = 12 
series1 = data_nba['Salary']
tail_data = series1.tail(n=12)
tail_data

446    12000000.0
447     1175880.0
448    15409570.0
449     1348440.0
450     2050000.0
451      981348.0
452     2239800.0
453     2433333.0
454      900000.0
455     2900000.0
456      947276.0
457           NaN
Name: Salary, dtype: float64

***Pandas DataFrame describe() Method***

Pandas describe() is used to view some basic statistical details like percentile, mean, std, etc. of a data frame or a series of numeric values.

(https://www.geeksforgeeks.org/python-pandas-dataframe-describe-method/)

In [45]:
print(data_nba.head())

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

In [46]:
print(data_nba.describe())

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

count: Total Number of Non-Empty values

mean: Mean of the column values

std: Standard Deviation of the column values

min: Minimum value from the column

25%: 25 percentile

50%: 50 percentile

75%: 75 percentile

max: Maximum value from the column

In [47]:
data_nba.dropna(inplace=True)

In [50]:
perc = [.20,.40,.60,.80]
include = ['object','float','int']
desc = data_nba.describe(percentiles=perc,include=include)
desc

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,364,364,364.000000,364,364.000000,364,364.000000,364,3.640000e+02
unique,364,30,NaN,5,NaN,17,NaN,115,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,16,NaN,87,NaN,49,NaN,22,NaN
mean,NaN,NaN,16.829670,NaN,26.615385,NaN,219.785714,NaN,4.620311e+06
std,NaN,NaN,14.994162,NaN,4.233591,NaN,24.793099,NaN,5.119716e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,5.572200e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.000000,NaN,9.472760e+05
40%,NaN,NaN,9.000000,NaN,25.000000,NaN,212.000000,NaN,1.638754e+06
50%,NaN,NaN,12.000000,NaN,26.000000,NaN,220.000000,NaN,2.515440e+06
60%,NaN,NaN,17.000000,NaN,27.000000,NaN,228.000000,NaN,3.429934e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,242.400000,NaN,7.838202e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,279.000000,NaN,2.287500e+07

***Describing series of strings***

In [52]:
desc1 = data_nba['Name'].describe()
desc1

count               364
unique              364
top       Avery Bradley
freq                  1
Name: Name, dtype: object